app/controllers/home_controller.rb

  def index
    @locations = Location.all
    @events = Event.all
---
SELECT "locations".* FROM "locations"
SELECT "events".* FROM "events"